app/controllers/games_controller.rb

	def create
		@user_game = current_user.user_games.new(params[:user_game])
		if @user_game.save
---
INSERT INTO `user_games` (`platform_id`, `rating`, `updated_at`, `user_id`, `game_id`, `created_at`) VALUES(3, 5, '2009-08-10 05:19:38', NULL, 1, '2009-08-10 05:19:38')

	def edit
		@user_game = current_user.user_games.find(params[:id])
---
SELECT * FROM `user_games` WHERE (`user_games`.`id` = 3 AND (`user_games`.user_id = 1))
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1

	def update
		@user_game = current_user.user_games.find(params[:id])
		@user_game.rating = params[:user_game][:rating]
		if @user_game.save
---
SELECT * FROM `user_games` WHERE (`user_games`.`id` = 3 AND (`user_games`.user_id = 1))
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
UPDATE `user_games` SET `rating` = 4, `updated_at` = '2009-08-10 05:29:05' WHERE `id` = 3

	def destroy
		@user_game = current_user.user_games.find(params[:id])
		game = @user_game.game
		if @user_game.destroy
---
SELECT * FROM `user_games` WHERE (`user_games`.`id` = 2 AND (`user_games`.user_id = 1))
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
DELETE FROM `user_games` WHERE `id` = 2