app/controllers/main_controller.rb

SELECT * FROM `events` WHERE (start_at > '2009-08-09 21:38:26' AND event_type_id = 2)
---
	def index
		@tournaments = Tournament.find(:all)
		@events = Event.find(:all)