app/controllers/user_profiles_controller.rb

	def index
		@user = current_user
		@user_profile = @user.user_profile.blank? ? UserProfile.new : @user.user_profile
---
SELECT * FROM `user_profiles` WHERE (`user_profiles`.user_id = 1) LIMIT 1